Repository: ZingerLittleBee/AnyDoor
Catalog: Sources/AnyDoor/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.translation.deepLHint
source: Leave the endpoint empty to use the official DeepL API (free/Pro chosen by your key). Fill it to use your self-hosted DeepLX instead.
zh_hans: 端点留空则使用 DeepL 官方 API（按 Key 自动选择免费/Pro）；填写则改用你自建的 DeepLX 服务。

# settings.translation.deepLToken
source: Access token (optional)
zh_hans: 访问令牌（可选）

# settings.translation.downloadLanguages
source: Download Language Pack
zh_hans: 下载语言包

# settings.translation.downloadLanguages.done
source: Downloaded
zh_hans: 已下载

# settings.translation.downloadLanguages.downloading
source: Downloading…
zh_hans: 下载中…

# settings.translation.downloadLanguages.failed
source: Retry Download
zh_hans: 重试下载

# settings.translation.downloadLanguages.help
source: Download the offline language pack for %1$@ ↔ %2$@
zh_hans: 下载 %1$@ ↔ %2$@ 的离线翻译语言包

# settings.translation.downloadLanguages.unsupported
source: Unsupported
zh_hans: 不支持

# settings.translation.edit
source: Edit
zh_hans: 编辑

# settings.translation.historyClear
source: Clear History
zh_hans: 清空历史

# settings.translation.historyRetention
source: Records to Keep
zh_hans: 保留条数

# settings.translation.historySection
source: History
zh_hans: 历史记录

# settings.translation.languageSection
source: Languages
zh_hans: 语言

# settings.translation.presetCustom
source: Custom
zh_hans: 自定义

# settings.translation.remove
source: Remove
zh_hans: 移除

# settings.translation.secondTarget
source: Fallback Target Language
zh_hans: 备用目标语言

# settings.translation.secondTargetFooter
source: Used instead when the detected source language matches the target language.
zh_hans: 当检测到的源语言与目标语言相同时，改用此语言。

# settings.translation.serviceBaseURLInvalid
source: Enter a valid http(s) Base URL, e.g. https://api.openai.com/v1
zh_hans: 请输入有效的 http(s) Base URL，例如 https://api.openai.com/v1

# settings.translation.serviceCancel
source: Cancel
zh_hans: 取消

# settings.translation.serviceExtraBody
source: Extra request body (JSON, optional)
zh_hans: 额外请求参数（JSON，可选）

# settings.translation.serviceExtraBodyHint
source: Extra top-level JSON merged into the request body, e.g. to disable thinking mode.
zh_hans: 合并进请求体的额外 JSON 字段，例如关闭思考模式。

# settings.translation.serviceExtraBodyInvalid
source: Extra parameters must be a valid JSON object.
zh_hans: 额外参数必须是合法的 JSON 对象。

# settings.translation.serviceExtraHeaders
source: Extra request headers (JSON, optional)
zh_hans: 额外请求头（JSON，可选）

# settings.translation.serviceExtraHeadersHint
source: Extra HTTP headers as a JSON object of strings. Use {{key}} for the API key, e.g. Azure OpenAI needs {"api-key":"{{key}}"}.
zh_hans: 以字符串 JSON 对象形式附加的 HTTP 请求头。用 {{key}} 代入 API 密钥，例如 Azure OpenAI 需要 {"api-key":"{{key}}"}。

# settings.translation.serviceExtraHeadersInvalid
source: Extra headers must be a JSON object whose values are all strings.
zh_hans: 额外请求头必须是值全部为字符串的 JSON 对象。

# settings.translation.serviceManualMode
source: Collapsed by default (translate manually)
zh_hans: 默认折叠（手动翻译）

# settings.translation.serviceManualModeHint
source: When collapsed this service does not auto-translate; expand its card to translate.
zh_hans: 折叠状态下不会自动翻译，展开卡片才会翻译。

# settings.translation.serviceModel
source: Model
zh_hans: 模型

# settings.translation.serviceName
source: Name
zh_hans: 名称

# settings.translation.servicePrompt
source: Prompt Template
zh_hans: 提示词模板

# settings.translation.servicePromptHint
source: Placeholders: {{source}} source language, {{target}} target language, {{text}} input text
zh_hans: 占位符：{{source}} 源语言、{{target}} 目标语言、{{text}} 待译文本

# settings.translation.servicePromptMissingText
source: The prompt is missing {{text}}; the source text will not be sent
zh_hans: 提示词缺少 {{text}}，待译文本将不会被发送

# settings.translation.serviceSave
source: Save
zh_hans: 保存

# settings.translation.serviceTest
source: Test
zh_hans: 测试

# settings.translation.serviceTestFailed
source: Connection failed
zh_hans: 连接失败

# settings.translation.serviceTestOK
source: Connected
zh_hans: 连接成功

# settings.translation.serviceTesting
source: Testing…
zh_hans: 测试中…

# settings.translation.servicesSection
source: Translation Services
zh_hans: 翻译服务

# settings.translation.targetLanguage
source: Target Language
zh_hans: 目标语言

# settingsGeneral.hyperKey.description
source: Pressing %1$@ will trigger the %2$@ modifier keys. Hyper Key shortcuts will be shown with ✦.
zh_hans: 按下 %1$@ 触发 %2$@ 修饰键组合。使用 Hyper Key 的快捷键会显示为 ✦。

# settingsGeneral.hyperKey.error.hidutil
source: Failed to enable: hidutil call failed.
zh_hans: 启用失败：hidutil 调用失败。

# settingsGeneral.hyperKey.error.tap
source: Failed to enable: Accessibility permission not granted.
zh_hans: 启用失败：辅助功能权限未授予。

# settingsGeneral.hyperKey.includeShift
source: Include Shift (⇧)
zh_hans: 包含 Shift (⇧)

# settingsGeneral.hyperKey.quickPress.description
source: Select an action to perform when %@ is pressed without any other keys.
zh_hans: 选择当 %@ 被单独按下时执行的动作。

# settingsGeneral.hyperKey.quickPress.doesNothing
source: Does Nothing
zh_hans: 不执行

# settingsGeneral.hyperKey.quickPress.original
source: Original Behavior
zh_hans: 保留原始功能

# settingsGeneral.hyperKey.trigger.none
source: None
zh_hans: 无

# shutdown.toast.failed
source: Scheduled shutdown failed
zh_hans: 定时关机失败

# shutdown.warning.cancel
source: Cancel
zh_hans: 取消

# shutdown.warning.message
source: Shutting down in %lld seconds
zh_hans: 将在 %lld 秒后关机

# shutdown.warning.title
source: Scheduled Shutdown
zh_hans: 定时关机

# toast.calc.copied
source: Copied %@
zh_hans: 已复制 %@

# toast.clipboardCleared
source: Clipboard cleared
zh_hans: 剪贴板已清空

# toast.color.copied
source: Copied %@
zh_hans: 已复制 %@

# toast.copiedToClipboard
source: Copied to clipboard
zh_hans: 已复制到剪贴板

# toast.emptyTrash.alreadyEmpty
source: Trash is already empty
zh_hans: 废纸篓已经是空的

# toast.emptyTrash.failed
source: Failed to empty the Trash
zh_hans: 清空废纸篓失败

# toast.emptyTrash.permissionDenied
source: Allow Automation to empty the Trash
zh_hans: 请授予自动化权限以清空废纸篓

# toast.emptyTrash.success
source: Trash emptied
zh_hans: 已清空废纸篓

# toast.micMute.unsupported
source: This input device can't be muted
zh_hans: 当前输入设备不支持静音

# toast.noSelectedText
source: No selected text found
zh_hans: 未读取到选中的文本

# toast.ocr.noText
source: No text detected
zh_hans: 未识别到文字

# toast.pickColor.failed
source: Color pick failed
zh_hans: 取色失败

# toast.portKill.failed
source: Failed to kill %@ (error %@)
zh_hans: 结束 %@ 失败（错误 %@）

# toast.portKill.gone
source: %@ already exited
zh_hans: %@ 已退出

# toast.portKill.permissionDenied
source: Failed to kill %@: permission denied
zh_hans: 结束 %@ 失败：权限不足

# toast.portKill.success
source: Killed %@ on :%@
zh_hans: 已结束 %@（:%@）

# toast.quicklink.missingFile
source: Quicklink target is missing
zh_hans: 快速入口目标不存在

# toast.quicklink.openFailed
source: Couldn’t open Quicklink
zh_hans: 打开快速入口失败

# toast.quicklink.openWithMissing
source: Open With app is missing, using the default app
zh_hans: 指定的打开方式不存在，已改用默认应用

# toast.qrcode.noCode
source: No QR code detected
zh_hans: 未识别到二维码

# toast.rates.updateFailed
source: Couldn’t update rates
zh_hans: 汇率更新失败

# toast.rates.updated
source: Rates updated (as of %@)
zh_hans: 汇率已更新（截至 %@）

# toast.recognitionFailed
source: Recognition failed
zh_hans: 识别失败

# toast.screenCapture.permissionDenied
source: Allow Screen Recording to capture text
zh_hans: 请授予屏幕录制权限以取词

# toast.windowLayout.failed
source: Window layout failed
zh_hans: 窗口布局失败

# toast.windowLayout.fullScreen
source: Full-screen windows can't be repositioned
zh_hans: 全屏窗口无法调整

# toast.windowLayout.needsAccessibility
source: Enable Accessibility to manage windows
zh_hans: 请开启辅助功能权限以管理窗口

# toast.windowLayout.noWindow
source: No active window to arrange
zh_hans: 没有可调整的当前窗口

# toast.windowLayout.singleDisplay
source: Only one display
zh_hans: 只有一个显示器

# translation.autoDetect
source: Auto Detect
zh_hans: 自动检测

# translation.autoDetect.hint
source: Auto Detect · %@
zh_hans: 自动检测 · %@

# translation.collapse
source: Collapse
zh_hans: 收起

# translation.copy
source: Copy
zh_hans: 复制

# translation.error
source: Translation failed
zh_hans: 翻译失败

# translation.error.decode
source: Could not parse the translation result
zh_hans: 无法解析翻译结果

# translation.error.emptyResponse
source: The translation service returned an empty result
zh_hans: 翻译服务返回了空结果

# translation.error.http
source: HTTP error %d
zh_hans: HTTP 错误 %d

# translation.error.missingAPIKey
source: API key not configured
zh_hans: 未配置 API Key

# translation.error.missingConfig
source: Service configuration is incomplete
zh_hans: 服务配置不完整

# translation.expand
source: Expand
zh_hans: 展开

# translation.history
source: History
zh_hans: 历史记录

# translation.history.all
source: All
zh_hans: 全部

# translation.history.delete
source: Delete
zh_hans: 删除

# translation.history.empty
source: No history yet
zh_hans: 暂无翻译记录

# translation.history.emptyFavorites
source: No favorites yet
zh_hans: 暂无收藏

# translation.history.favorite
source: Add to Favorites
zh_hans: 收藏

# translation.history.favorites
source: Favorites
zh_hans: 收藏

# translation.history.originalLabel
source: Original
zh_hans: 原文

# translation.history.retranslate
source: Re-translate
zh_hans: 重新翻译

# translation.history.unfavorite
source: Remove from Favorites
zh_hans: 取消收藏

# translation.inputPlaceholder
source: Enter text to translate…
zh_hans: 输入要翻译的文本…

# translation.manualCollapsedHint
source: Manual · tap to translate
zh_hans: 手动 · 点击翻译

# translation.pin
source: Pin Window
zh_hans: 固定窗口

# translation.recognizedAs
source: Detected: %@
zh_hans: 识别为：%@

# translation.screenshot
source: Screenshot Translate
zh_hans: 截图翻译

# translation.settings
source: Settings
zh_hans: 设置

# translation.speak
source: Speak
zh_hans: 朗读

# translation.swap
source: Swap languages
zh_hans: 切换语言

# translation.translating
source: Translating…
zh_hans: 翻译中…

# translation.unpin
source: Unpin Window
zh_hans: 取消固定窗口

# update.banner.available
source: AnyDoor %@ available
zh_hans: AnyDoor %@ 可更新

# update.banner.dismissForSession
source: Dismiss for this session
zh_hans: 本次启动不再提醒

# update.banner.viewAndInstall
source: View and install update
zh_hans: 查看并安装更新

# commandPalette.pluginRow.loading
source: Loading…
zh_hans: 加载中…

# commandPalette.pluginRow.error
source: Failed to load
zh_hans: 加载失败

# commandPalette.retry
source: Retry
zh_hans: 重试

# commandPalette.detail.failed
source: Couldn’t load details
zh_hans: 无法加载详情

# plugins.action.failed
source: The plugin action failed
zh_hans: 插件操作失败

# plugins.developerMode
source: Developer Mode
zh_hans: 开发者模式

# plugins.developerMode.hint
source: Load a plugin directly from a development folder, with automatic reload on change.
zh_hans: 直接从开发目录加载插件，文件变更时自动重新加载。

# plugins.section.dev
source: Dev Plugins
zh_hans: 开发插件

# plugins.dev.empty
source: No dev plugins registered.
zh_hans: 尚未注册开发插件。

# plugins.registerDev
source: Register Dev Plugin…
zh_hans: 注册开发插件…

# plugins.registerDev.failed
source: Failed to register the dev plugin: %@
zh_hans: 注册开发插件失败：%@

# plugins.removeDev
source: Remove
zh_hans: 移除

# plugins.state.dev
source: Dev
zh_hans: 开发中
